In [ ]:
! pip install pandas

In [2]:
import pandas as pd

In [4]:
s = pd.Series([23,24,25,26,27,32,40], name= 'Age')
s

0    23
1    24
2    25
3    26
4    27
5    32
6    40
Name: Age, dtype: int64

In [5]:
s = pd.Series([23,24,25,26,27,32,40], name= 'Age', 
index=['a','b','c','d','e','f','g'])
s

a    23
b    24
c    25
d    26
e    27
f    32
g    40
Name: Age, dtype: int64

In [6]:
s['b']

24

In [8]:
s.sum()
s.mean()

28.142857142857142

In [11]:
# Dataframe #efficient way is List
df = pd.DataFrame({
    "Name" :["Aftab","Rahman","Ayushe","Soahana","Wahid"],
    "Age" : [23,25,22,56,85]
})  
df

In [31]:
df.set_index("Name")

         Age
Name
Aftab     23
Rahman    25
Ayushe    22
Soahana   56
Wahid     85

In [1]:
df

NameError: name 'df' is not defined

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    5 non-null      object
 1   Age     5 non-null      int64
dtypes: int64(1), object(1)
memory usage: 208.0+ bytes

In [16]:
df.describe()

             Age
count   5.000000
mean   42.200000
std    27.815463
min    22.000000
25%    23.000000
50%    25.000000
75%    56.000000
max    85.000000

In [17]:
df['Name']

0      Aftab
1     Rahman
2     Ayushe
3    Soahana
4      Wahid
Name: Name, dtype: object

In [18]:
df['Age']

0    23
1    25
2    22
3    56
4    85
Name: Age, dtype: int64

In [19]:
df[['Name','Age']]

      Name  Age
0    Aftab   23
1   Rahman   25
2   Ayushe   22
3  Soahana   56
4    Wahid   85

In [21]:
df.head(3) #top 3 index

     Name  Age
0   Aftab   23
1  Rahman   25
2  Ayushe   22

In [22]:
df.tail(3)

      Name  Age
2   Ayushe   22
3  Soahana   56
4    Wahid   85

In [23]:
df.iloc[1] #to access a row

Name    Rahman
Age         25
Name: 1, dtype: object

In [24]:
df.iloc[1,1]

25

In [26]:
df.drop(3)

     Name  Age
0   Aftab   23
1  Rahman   25
2  Ayushe   22
4   Wahid   85

In [27]:
df[df["Age"]==25]

     Name  Age
1  Rahman   25

In [28]:
df[df["Age"]>25]

      Name  Age
3  Soahana   56
4    Wahid   85

In [30]:
df[df["Age"]>25][df["Age"]<85]

C:\Users\user\AppData\Local\Temp/ipykernel_4244/620751037.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  df[df["Age"]>25][df["Age"]<85]

      Name  Age
3  Soahana   56

Reading from file

In [ ]:
df = pd.read_csv("path of a csv file")
df.head()

In [ ]:
df.info()

In [ ]:
df.describe() # to show the statistics

In [ ]:
df.loc[(df["column name1"]>25) & (df["column name2"]<60)]
#to locate any info
# u can use or, not operation

In [ ]:
df[~(df["any colum in the file"]==12)]
#will return the result which is not true

In [ ]:
df.loc[(df["column name1"]>25) | (df["column name2"]<60)]

In [ ]:
pd.read_excel("s.xlsx", sheet_name="sheet1")

In [ ]:
df.columns #to show columns

In [ ]:
df.rename(columns={"Modelyear":"MY"}) #to change the name

In [ ]:
d = df.reset_index()
d

In [ ]:
df.set_index("Modelyear")

In [ ]:
df["any column name"][index0,1] = 36 #to chanhe any value
df["any column name"][index0,1]

In [ ]:
df.groupby(by=["column1","column2"])
df.groupby(by=["column1","column2"]).mean()

In [ ]:
df[df["model"].isin(['ilx','rdx','bmw'])] #to select particulr models

In [ ]:
df.shape

In [ ]:
df.value_counts()  #returns the unique values

In [ ]:
type(df.values)

In [36]:
df = pd.DataFrame({
    "name" :["a","b","c"],
    "age":[12,None,45]
})

In [37]:
df.dropna()

  name   age
0    a  12.0
2    c  45.0

In [38]:
df.dropna(axis=1)

  name
0    a
1    b
2    c

In [39]:
df.fillna(30)

  name   age
0    a  12.0
1    b  30.0
2    c  45.0

In [44]:
df = pd.DataFrame({
    "name" :["a","b","c"],
    "age":["12",None,"45"]
})

In [45]:
df.age = pd.to_numeric(df.age)
df.age

ValueError: Unable to parse string "None" at position 1